RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL46Z4/include/MKL46Z4_extension.h
/*! @brief Set the BPCLCD50 field to a new value. */
#define LCD_WR_WF8B_BPCLCD50(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD50_MASK, LCD_WF8B_BPCLCD50(value)))
#define LCD_BWR_WF8B_BPCLCD50(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD50_SHIFT), LCD_WF8B_BPCLCD50_SHIFT, LCD_WF8B_BPCLCD50_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD19[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD19 field. */
#define LCD_RD_WF8B_BPCLCD19(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD19_MASK) >> LCD_WF8B_BPCLCD19_SHIFT)
#define LCD_BRD_WF8B_BPCLCD19(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD19_SHIFT, LCD_WF8B_BPCLCD19_WIDTH))

/*! @brief Set the BPCLCD19 field to a new value. */
#define LCD_WR_WF8B_BPCLCD19(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD19_MASK, LCD_WF8B_BPCLCD19(value)))
#define LCD_BWR_WF8B_BPCLCD19(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD19_SHIFT), LCD_WF8B_BPCLCD19_SHIFT, LCD_WF8B_BPCLCD19_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD26[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD26 field. */
#define LCD_RD_WF8B_BPCLCD26(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD26_MASK) >> LCD_WF8B_BPCLCD26_SHIFT)
#define LCD_BRD_WF8B_BPCLCD26(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD26_SHIFT, LCD_WF8B_BPCLCD26_WIDTH))

/*! @brief Set the BPCLCD26 field to a new value. */
#define LCD_WR_WF8B_BPCLCD26(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD26_MASK, LCD_WF8B_BPCLCD26(value)))
#define LCD_BWR_WF8B_BPCLCD26(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD26_SHIFT), LCD_WF8B_BPCLCD26_SHIFT, LCD_WF8B_BPCLCD26_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD59[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD59 field. */
#define LCD_RD_WF8B_BPCLCD59(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD59_MASK) >> LCD_WF8B_BPCLCD59_SHIFT)
#define LCD_BRD_WF8B_BPCLCD59(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD59_SHIFT, LCD_WF8B_BPCLCD59_WIDTH))

/*! @brief Set the BPCLCD59 field to a new value. */
#define LCD_WR_WF8B_BPCLCD59(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD59_MASK, LCD_WF8B_BPCLCD59(value)))
#define LCD_BWR_WF8B_BPCLCD59(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD59_SHIFT), LCD_WF8B_BPCLCD59_SHIFT, LCD_WF8B_BPCLCD59_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD61[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD61 field. */
#define LCD_RD_WF8B_BPCLCD61(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD61_MASK) >> LCD_WF8B_BPCLCD61_SHIFT)
#define LCD_BRD_WF8B_BPCLCD61(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD61_SHIFT, LCD_WF8B_BPCLCD61_WIDTH))

/*! @brief Set the BPCLCD61 field to a new value. */
#define LCD_WR_WF8B_BPCLCD61(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD61_MASK, LCD_WF8B_BPCLCD61(value)))
#define LCD_BWR_WF8B_BPCLCD61(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD61_SHIFT), LCD_WF8B_BPCLCD61_SHIFT, LCD_WF8B_BPCLCD61_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD46[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD46 field. */
#define LCD_RD_WF8B_BPCLCD46(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD46_MASK) >> LCD_WF8B_BPCLCD46_SHIFT)
#define LCD_BRD_WF8B_BPCLCD46(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD46_SHIFT, LCD_WF8B_BPCLCD46_WIDTH))

/*! @brief Set the BPCLCD46 field to a new value. */
#define LCD_WR_WF8B_BPCLCD46(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD46_MASK, LCD_WF8B_BPCLCD46(value)))
#define LCD_BWR_WF8B_BPCLCD46(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD46_SHIFT), LCD_WF8B_BPCLCD46_SHIFT, LCD_WF8B_BPCLCD46_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD18[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD18 field. */
#define LCD_RD_WF8B_BPCLCD18(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD18_MASK) >> LCD_WF8B_BPCLCD18_SHIFT)
#define LCD_BRD_WF8B_BPCLCD18(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD18_SHIFT, LCD_WF8B_BPCLCD18_WIDTH))

/*! @brief Set the BPCLCD18 field to a new value. */
#define LCD_WR_WF8B_BPCLCD18(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD18_MASK, LCD_WF8B_BPCLCD18(value)))
#define LCD_BWR_WF8B_BPCLCD18(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD18_SHIFT), LCD_WF8B_BPCLCD18_SHIFT, LCD_WF8B_BPCLCD18_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD5[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD5 field. */
#define LCD_RD_WF8B_BPCLCD5(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD5_MASK) >> LCD_WF8B_BPCLCD5_SHIFT)
#define LCD_BRD_WF8B_BPCLCD5(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD5_SHIFT, LCD_WF8B_BPCLCD5_WIDTH))

/*! @brief Set the BPCLCD5 field to a new value. */
#define LCD_WR_WF8B_BPCLCD5(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD5_MASK, LCD_WF8B_BPCLCD5(value)))
#define LCD_BWR_WF8B_BPCLCD5(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD5_SHIFT), LCD_WF8B_BPCLCD5_SHIFT, LCD_WF8B_BPCLCD5_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD63[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD63 field. */
#define LCD_RD_WF8B_BPCLCD63(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD63_MASK) >> LCD_WF8B_BPCLCD63_SHIFT)
#define LCD_BRD_WF8B_BPCLCD63(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD63_SHIFT, LCD_WF8B_BPCLCD63_WIDTH))

/*! @brief Set the BPCLCD63 field to a new value. */
#define LCD_WR_WF8B_BPCLCD63(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD63_MASK, LCD_WF8B_BPCLCD63(value)))
#define LCD_BWR_WF8B_BPCLCD63(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD63_SHIFT), LCD_WF8B_BPCLCD63_SHIFT, LCD_WF8B_BPCLCD63_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD27[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD27 field. */
#define LCD_RD_WF8B_BPCLCD27(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD27_MASK) >> LCD_WF8B_BPCLCD27_SHIFT)
#define LCD_BRD_WF8B_BPCLCD27(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD27_SHIFT, LCD_WF8B_BPCLCD27_WIDTH))

