RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL46Z4/include/MKL46Z4_extension.h
/*! @brief Set the BPCLCD45 field to a new value. */
#define LCD_WR_WF8B_BPCLCD45(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD45_MASK, LCD_WF8B_BPCLCD45(value)))
#define LCD_BWR_WF8B_BPCLCD45(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD45_SHIFT), LCD_WF8B_BPCLCD45_SHIFT, LCD_WF8B_BPCLCD45_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD57[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD57 field. */
#define LCD_RD_WF8B_BPCLCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD57_MASK) >> LCD_WF8B_BPCLCD57_SHIFT)
#define LCD_BRD_WF8B_BPCLCD57(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD57_SHIFT, LCD_WF8B_BPCLCD57_WIDTH))

/*! @brief Set the BPCLCD57 field to a new value. */
#define LCD_WR_WF8B_BPCLCD57(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD57_MASK, LCD_WF8B_BPCLCD57(value)))
#define LCD_BWR_WF8B_BPCLCD57(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD57_SHIFT), LCD_WF8B_BPCLCD57_SHIFT, LCD_WF8B_BPCLCD57_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD42[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD42 field. */
#define LCD_RD_WF8B_BPCLCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD42_MASK) >> LCD_WF8B_BPCLCD42_SHIFT)
#define LCD_BRD_WF8B_BPCLCD42(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD42_SHIFT, LCD_WF8B_BPCLCD42_WIDTH))

/*! @brief Set the BPCLCD42 field to a new value. */
#define LCD_WR_WF8B_BPCLCD42(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD42_MASK, LCD_WF8B_BPCLCD42(value)))
#define LCD_BWR_WF8B_BPCLCD42(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD42_SHIFT), LCD_WF8B_BPCLCD42_SHIFT, LCD_WF8B_BPCLCD42_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD35[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD35 field. */
#define LCD_RD_WF8B_BPCLCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD35_MASK) >> LCD_WF8B_BPCLCD35_SHIFT)
#define LCD_BRD_WF8B_BPCLCD35(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD35_SHIFT, LCD_WF8B_BPCLCD35_WIDTH))

/*! @brief Set the BPCLCD35 field to a new value. */
#define LCD_WR_WF8B_BPCLCD35(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD35_MASK, LCD_WF8B_BPCLCD35(value)))
#define LCD_BWR_WF8B_BPCLCD35(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD35_SHIFT), LCD_WF8B_BPCLCD35_SHIFT, LCD_WF8B_BPCLCD35_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD13[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD13 field. */
#define LCD_RD_WF8B_BPCLCD13(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD13_MASK) >> LCD_WF8B_BPCLCD13_SHIFT)
#define LCD_BRD_WF8B_BPCLCD13(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD13_SHIFT, LCD_WF8B_BPCLCD13_WIDTH))

/*! @brief Set the BPCLCD13 field to a new value. */
#define LCD_WR_WF8B_BPCLCD13(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD13_MASK, LCD_WF8B_BPCLCD13(value)))
#define LCD_BWR_WF8B_BPCLCD13(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD13_SHIFT), LCD_WF8B_BPCLCD13_SHIFT, LCD_WF8B_BPCLCD13_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD36[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD36 field. */
#define LCD_RD_WF8B_BPCLCD36(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD36_MASK) >> LCD_WF8B_BPCLCD36_SHIFT)
#define LCD_BRD_WF8B_BPCLCD36(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD36_SHIFT, LCD_WF8B_BPCLCD36_WIDTH))

/*! @brief Set the BPCLCD36 field to a new value. */
#define LCD_WR_WF8B_BPCLCD36(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD36_MASK, LCD_WF8B_BPCLCD36(value)))
#define LCD_BWR_WF8B_BPCLCD36(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD36_SHIFT), LCD_WF8B_BPCLCD36_SHIFT, LCD_WF8B_BPCLCD36_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD30[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD30 field. */
#define LCD_RD_WF8B_BPCLCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD30_MASK) >> LCD_WF8B_BPCLCD30_SHIFT)
#define LCD_BRD_WF8B_BPCLCD30(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD30_SHIFT, LCD_WF8B_BPCLCD30_WIDTH))

/*! @brief Set the BPCLCD30 field to a new value. */
#define LCD_WR_WF8B_BPCLCD30(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD30_MASK, LCD_WF8B_BPCLCD30(value)))
#define LCD_BWR_WF8B_BPCLCD30(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD30_SHIFT), LCD_WF8B_BPCLCD30_SHIFT, LCD_WF8B_BPCLCD30_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD52[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD52 field. */
#define LCD_RD_WF8B_BPCLCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD52_MASK) >> LCD_WF8B_BPCLCD52_SHIFT)
#define LCD_BRD_WF8B_BPCLCD52(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD52_SHIFT, LCD_WF8B_BPCLCD52_WIDTH))

/*! @brief Set the BPCLCD52 field to a new value. */
#define LCD_WR_WF8B_BPCLCD52(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD52_MASK, LCD_WF8B_BPCLCD52(value)))
#define LCD_BWR_WF8B_BPCLCD52(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD52_SHIFT), LCD_WF8B_BPCLCD52_SHIFT, LCD_WF8B_BPCLCD52_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD58[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD58 field. */
#define LCD_RD_WF8B_BPCLCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD58_MASK) >> LCD_WF8B_BPCLCD58_SHIFT)
#define LCD_BRD_WF8B_BPCLCD58(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD58_SHIFT, LCD_WF8B_BPCLCD58_WIDTH))

