RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL46Z4/include/MKL46Z4_extension.h
/*! @brief Set the BPCLCD31 field to a new value. */
#define LCD_WR_WF8B_BPCLCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD31_MASK, LCD_WF8B_BPCLCD31(value)))
#define LCD_BWR_WF8B_BPCLCD31(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD31_SHIFT), LCD_WF8B_BPCLCD31_SHIFT, LCD_WF8B_BPCLCD31_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD40[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD40 field. */
#define LCD_RD_WF8B_BPCLCD40(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD40_MASK) >> LCD_WF8B_BPCLCD40_SHIFT)
#define LCD_BRD_WF8B_BPCLCD40(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD40_SHIFT, LCD_WF8B_BPCLCD40_WIDTH))

/*! @brief Set the BPCLCD40 field to a new value. */
#define LCD_WR_WF8B_BPCLCD40(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD40_MASK, LCD_WF8B_BPCLCD40(value)))
#define LCD_BWR_WF8B_BPCLCD40(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD40_SHIFT), LCD_WF8B_BPCLCD40_SHIFT, LCD_WF8B_BPCLCD40_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD62[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD62 field. */
#define LCD_RD_WF8B_BPCLCD62(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD62_MASK) >> LCD_WF8B_BPCLCD62_SHIFT)
#define LCD_BRD_WF8B_BPCLCD62(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD62_SHIFT, LCD_WF8B_BPCLCD62_WIDTH))

/*! @brief Set the BPCLCD62 field to a new value. */
#define LCD_WR_WF8B_BPCLCD62(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD62_MASK, LCD_WF8B_BPCLCD62(value)))
#define LCD_BWR_WF8B_BPCLCD62(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD62_SHIFT), LCD_WF8B_BPCLCD62_SHIFT, LCD_WF8B_BPCLCD62_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD56[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD56 field. */
#define LCD_RD_WF8B_BPCLCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD56_MASK) >> LCD_WF8B_BPCLCD56_SHIFT)
#define LCD_BRD_WF8B_BPCLCD56(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD56_SHIFT, LCD_WF8B_BPCLCD56_WIDTH))

/*! @brief Set the BPCLCD56 field to a new value. */
#define LCD_WR_WF8B_BPCLCD56(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD56_MASK, LCD_WF8B_BPCLCD56(value)))
#define LCD_BWR_WF8B_BPCLCD56(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD56_SHIFT), LCD_WF8B_BPCLCD56_SHIFT, LCD_WF8B_BPCLCD56_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD39[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD39 field. */
#define LCD_RD_WF8B_BPCLCD39(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD39_MASK) >> LCD_WF8B_BPCLCD39_SHIFT)
#define LCD_BRD_WF8B_BPCLCD39(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD39_SHIFT, LCD_WF8B_BPCLCD39_WIDTH))

/*! @brief Set the BPCLCD39 field to a new value. */
#define LCD_WR_WF8B_BPCLCD39(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD39_MASK, LCD_WF8B_BPCLCD39(value)))
#define LCD_BWR_WF8B_BPCLCD39(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD39_SHIFT), LCD_WF8B_BPCLCD39_SHIFT, LCD_WF8B_BPCLCD39_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD6[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD6 field. */
#define LCD_RD_WF8B_BPCLCD6(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD6_MASK) >> LCD_WF8B_BPCLCD6_SHIFT)
#define LCD_BRD_WF8B_BPCLCD6(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD6_SHIFT, LCD_WF8B_BPCLCD6_WIDTH))

/*! @brief Set the BPCLCD6 field to a new value. */
#define LCD_WR_WF8B_BPCLCD6(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD6_MASK, LCD_WF8B_BPCLCD6(value)))
#define LCD_BWR_WF8B_BPCLCD6(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD6_SHIFT), LCD_WF8B_BPCLCD6_SHIFT, LCD_WF8B_BPCLCD6_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD47[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD47 field. */
#define LCD_RD_WF8B_BPDLCD47(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD47_MASK) >> LCD_WF8B_BPDLCD47_SHIFT)
#define LCD_BRD_WF8B_BPDLCD47(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD47_SHIFT, LCD_WF8B_BPDLCD47_WIDTH))

/*! @brief Set the BPDLCD47 field to a new value. */
#define LCD_WR_WF8B_BPDLCD47(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD47_MASK, LCD_WF8B_BPDLCD47(value)))
#define LCD_BWR_WF8B_BPDLCD47(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD47_SHIFT), LCD_WF8B_BPDLCD47_SHIFT, LCD_WF8B_BPDLCD47_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD23[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD23 field. */
#define LCD_RD_WF8B_BPDLCD23(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD23_MASK) >> LCD_WF8B_BPDLCD23_SHIFT)
#define LCD_BRD_WF8B_BPDLCD23(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD23_SHIFT, LCD_WF8B_BPDLCD23_WIDTH))

/*! @brief Set the BPDLCD23 field to a new value. */
#define LCD_WR_WF8B_BPDLCD23(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD23_MASK, LCD_WF8B_BPDLCD23(value)))
#define LCD_BWR_WF8B_BPDLCD23(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD23_SHIFT), LCD_WF8B_BPDLCD23_SHIFT, LCD_WF8B_BPDLCD23_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD48[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD48 field. */
#define LCD_RD_WF8B_BPDLCD48(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD48_MASK) >> LCD_WF8B_BPDLCD48_SHIFT)
#define LCD_BRD_WF8B_BPDLCD48(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD48_SHIFT, LCD_WF8B_BPDLCD48_WIDTH))

/*! @brief Set the BPDLCD48 field to a new value. */
#define LCD_WR_WF8B_BPDLCD48(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD48_MASK, LCD_WF8B_BPDLCD48(value)))
#define LCD_BWR_WF8B_BPDLCD48(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD48_SHIFT), LCD_WF8B_BPDLCD48_SHIFT, LCD_WF8B_BPDLCD48_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD24[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD24 field. */
#define LCD_RD_WF8B_BPDLCD24(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD24_MASK) >> LCD_WF8B_BPDLCD24_SHIFT)
#define LCD_BRD_WF8B_BPDLCD24(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD24_SHIFT, LCD_WF8B_BPDLCD24_WIDTH))

/*! @brief Set the BPDLCD24 field to a new value. */
#define LCD_WR_WF8B_BPDLCD24(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD24_MASK, LCD_WF8B_BPDLCD24(value)))
#define LCD_BWR_WF8B_BPDLCD24(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD24_SHIFT), LCD_WF8B_BPDLCD24_SHIFT, LCD_WF8B_BPDLCD24_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD15[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD15 field. */
#define LCD_RD_WF8B_BPDLCD15(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD15_MASK) >> LCD_WF8B_BPDLCD15_SHIFT)
#define LCD_BRD_WF8B_BPDLCD15(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD15_SHIFT, LCD_WF8B_BPDLCD15_WIDTH))

/*! @brief Set the BPDLCD15 field to a new value. */
#define LCD_WR_WF8B_BPDLCD15(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD15_MASK, LCD_WF8B_BPDLCD15(value)))
#define LCD_BWR_WF8B_BPDLCD15(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD15_SHIFT), LCD_WF8B_BPDLCD15_SHIFT, LCD_WF8B_BPDLCD15_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD22[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD22 field. */
#define LCD_RD_WF8B_BPDLCD22(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD22_MASK) >> LCD_WF8B_BPDLCD22_SHIFT)
#define LCD_BRD_WF8B_BPDLCD22(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD22_SHIFT, LCD_WF8B_BPDLCD22_WIDTH))

/*! @brief Set the BPDLCD22 field to a new value. */
#define LCD_WR_WF8B_BPDLCD22(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD22_MASK, LCD_WF8B_BPDLCD22(value)))
#define LCD_BWR_WF8B_BPDLCD22(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD22_SHIFT), LCD_WF8B_BPDLCD22_SHIFT, LCD_WF8B_BPDLCD22_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD60[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD60 field. */
#define LCD_RD_WF8B_BPDLCD60(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD60_MASK) >> LCD_WF8B_BPDLCD60_SHIFT)
#define LCD_BRD_WF8B_BPDLCD60(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD60_SHIFT, LCD_WF8B_BPDLCD60_WIDTH))

