RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL46Z4/include/MKL46Z4_extension.h
/*! @brief Set the BPHLCD44 field to a new value. */
#define LCD_WR_WF8B_BPHLCD44(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD44_MASK, LCD_WF8B_BPHLCD44(value)))
#define LCD_BWR_WF8B_BPHLCD44(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD44_SHIFT), LCD_WF8B_BPHLCD44_SHIFT, LCD_WF8B_BPHLCD44_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD43[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD43 field. */
#define LCD_RD_WF8B_BPHLCD43(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD43_MASK) >> LCD_WF8B_BPHLCD43_SHIFT)
#define LCD_BRD_WF8B_BPHLCD43(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD43_SHIFT, LCD_WF8B_BPHLCD43_WIDTH))

/*! @brief Set the BPHLCD43 field to a new value. */
#define LCD_WR_WF8B_BPHLCD43(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD43_MASK, LCD_WF8B_BPHLCD43(value)))
#define LCD_BWR_WF8B_BPHLCD43(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD43_SHIFT), LCD_WF8B_BPHLCD43_SHIFT, LCD_WF8B_BPHLCD43_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD2[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD2 field. */
#define LCD_RD_WF8B_BPHLCD2(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD2_MASK) >> LCD_WF8B_BPHLCD2_SHIFT)
#define LCD_BRD_WF8B_BPHLCD2(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD2_SHIFT, LCD_WF8B_BPHLCD2_WIDTH))

/*! @brief Set the BPHLCD2 field to a new value. */
#define LCD_WR_WF8B_BPHLCD2(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD2_MASK, LCD_WF8B_BPHLCD2(value)))
#define LCD_BWR_WF8B_BPHLCD2(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD2_SHIFT), LCD_WF8B_BPHLCD2_SHIFT, LCD_WF8B_BPHLCD2_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD42[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD42 field. */
#define LCD_RD_WF8B_BPHLCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD42_MASK) >> LCD_WF8B_BPHLCD42_SHIFT)
#define LCD_BRD_WF8B_BPHLCD42(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD42_SHIFT, LCD_WF8B_BPHLCD42_WIDTH))

/*! @brief Set the BPHLCD42 field to a new value. */
#define LCD_WR_WF8B_BPHLCD42(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD42_MASK, LCD_WF8B_BPHLCD42(value)))
#define LCD_BWR_WF8B_BPHLCD42(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD42_SHIFT), LCD_WF8B_BPHLCD42_SHIFT, LCD_WF8B_BPHLCD42_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD41[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD41 field. */
#define LCD_RD_WF8B_BPHLCD41(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD41_MASK) >> LCD_WF8B_BPHLCD41_SHIFT)
#define LCD_BRD_WF8B_BPHLCD41(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD41_SHIFT, LCD_WF8B_BPHLCD41_WIDTH))

/*! @brief Set the BPHLCD41 field to a new value. */
#define LCD_WR_WF8B_BPHLCD41(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD41_MASK, LCD_WF8B_BPHLCD41(value)))
#define LCD_BWR_WF8B_BPHLCD41(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD41_SHIFT), LCD_WF8B_BPHLCD41_SHIFT, LCD_WF8B_BPHLCD41_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD40[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD40 field. */
#define LCD_RD_WF8B_BPHLCD40(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD40_MASK) >> LCD_WF8B_BPHLCD40_SHIFT)
#define LCD_BRD_WF8B_BPHLCD40(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD40_SHIFT, LCD_WF8B_BPHLCD40_WIDTH))

/*! @brief Set the BPHLCD40 field to a new value. */
#define LCD_WR_WF8B_BPHLCD40(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD40_MASK, LCD_WF8B_BPHLCD40(value)))
#define LCD_BWR_WF8B_BPHLCD40(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD40_SHIFT), LCD_WF8B_BPHLCD40_SHIFT, LCD_WF8B_BPHLCD40_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD39[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD39 field. */
#define LCD_RD_WF8B_BPHLCD39(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD39_MASK) >> LCD_WF8B_BPHLCD39_SHIFT)
#define LCD_BRD_WF8B_BPHLCD39(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD39_SHIFT, LCD_WF8B_BPHLCD39_WIDTH))

/*! @brief Set the BPHLCD39 field to a new value. */
#define LCD_WR_WF8B_BPHLCD39(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD39_MASK, LCD_WF8B_BPHLCD39(value)))
#define LCD_BWR_WF8B_BPHLCD39(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD39_SHIFT), LCD_WF8B_BPHLCD39_SHIFT, LCD_WF8B_BPHLCD39_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD38[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD38 field. */
#define LCD_RD_WF8B_BPHLCD38(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD38_MASK) >> LCD_WF8B_BPHLCD38_SHIFT)
#define LCD_BRD_WF8B_BPHLCD38(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD38_SHIFT, LCD_WF8B_BPHLCD38_WIDTH))

